/*
コード実行時のfunctionの書き方色々
*/

/*==================
    ■通常の関数定義
==================*/
function hoge(){
    //処理内容
    alert("通常の関数定義");
};

/*==================
    ■無名関数
    下記の書き方と同意
    
    var test = function test(){
    }
==================*/
//無名関数 
 var test = function (){
    //処理内容
    alert("無名関数で実行");
};

/*==================
    ■即時関数
    関数定義と関数呼び出しをセットにしたもの
==================*/
//関数定義
function test2(){
  //処理内容
  alert("即時関数1");
};

//関数呼び出し
test2();

/*==================
    ■即時関数2
    セットの書き方
==================*/
(function unitopi(){
   //処理内容
   alert("即時関数2");
})();

/*==================
    ■即時関数3
    関数名の省略も可能
==================*/
(function (){
  //処理内容
  alert("即時関数3");
})();